#+OPTIONS: toc:nil

* Longest Collatz sequence

** Task

The following iterative sequence is defined for the set of positive integers:

n → n/2 (n is even)
n → 3n + 1 (n is odd)

Using the rule above and starting with 13, we generate the following sequence:

13 → 40 → 20 → 10 → 5 → 16 → 8 → 4 → 2 → 1
It can be seen that this sequence (starting at 13 and finishing at 1) contains
10 terms. Although it has not been proved yet (Collatz Problem), it is thought
that all starting numbers finish at 1.

Which starting number, under one million, produces the longest chain?

NOTE: Once the chain starts the terms are allowed to go above one million.

** Solution

#+BEGIN_SRC python :results output :exports both
collatz_sequence = {1: 1}

def collatz_length(n):
    if n in collatz_sequence:
        return collatz_sequence[n]
    else:
        if n % 2 == 0:
            new_n = int(n / 2)
        else:
            new_n = 3 * n + 1

        length = collatz_length(new_n) + 1
        collatz_sequence[n] = length
        return length

largest = 1
for i in range(1, 1000000):
    if collatz_length(i) > collatz_sequence[largest]:
        largest = i

print(largest)
#+END_SRC

#+RESULTS:
: 837799
